; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l6-t1-p4---int100n150-m25---int100c110---s48---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 l4 l5 - location
t0 - truck
p0 p1 p2 p3 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 - fuellevel
)

(:init
(sum level0 level5 level5)
(sum level0 level7 level7)
(sum level0 level10 level10)
(sum level0 level14 level14)
(sum level0 level16 level16)
(sum level0 level18 level18)
(sum level0 level21 level21)
(sum level0 level23 level23)
(sum level1 level5 level6)
(sum level1 level7 level8)
(sum level1 level10 level11)
(sum level1 level14 level15)
(sum level1 level16 level17)
(sum level1 level18 level19)
(sum level1 level21 level22)
(sum level1 level23 level24)
(sum level2 level5 level7)
(sum level2 level7 level9)
(sum level2 level10 level12)
(sum level2 level14 level16)
(sum level2 level16 level18)
(sum level2 level18 level20)
(sum level2 level21 level23)
(sum level2 level23 level25)
(sum level3 level5 level8)
(sum level3 level7 level10)
(sum level3 level10 level13)
(sum level3 level14 level17)
(sum level3 level16 level19)
(sum level3 level18 level21)
(sum level3 level21 level24)
(sum level3 level23 level26)
(sum level4 level5 level9)
(sum level4 level7 level11)
(sum level4 level10 level14)
(sum level4 level14 level18)
(sum level4 level16 level20)
(sum level4 level18 level22)
(sum level4 level21 level25)
(sum level4 level23 level27)
(sum level5 level5 level10)
(sum level5 level7 level12)
(sum level5 level10 level15)
(sum level5 level14 level19)
(sum level5 level16 level21)
(sum level5 level18 level23)
(sum level5 level21 level26)
(sum level5 level23 level28)
(sum level6 level5 level11)
(sum level6 level7 level13)
(sum level6 level10 level16)
(sum level6 level14 level20)
(sum level6 level16 level22)
(sum level6 level18 level24)
(sum level6 level21 level27)
(sum level6 level23 level29)
(sum level7 level5 level12)
(sum level7 level7 level14)
(sum level7 level10 level17)
(sum level7 level14 level21)
(sum level7 level16 level23)
(sum level7 level18 level25)
(sum level7 level21 level28)
(sum level7 level23 level30)
(sum level8 level5 level13)
(sum level8 level7 level15)
(sum level8 level10 level18)
(sum level8 level14 level22)
(sum level8 level16 level24)
(sum level8 level18 level26)
(sum level8 level21 level29)
(sum level8 level23 level31)
(sum level9 level5 level14)
(sum level9 level7 level16)
(sum level9 level10 level19)
(sum level9 level14 level23)
(sum level9 level16 level25)
(sum level9 level18 level27)
(sum level9 level21 level30)
(sum level9 level23 level32)
(sum level10 level5 level15)
(sum level10 level7 level17)
(sum level10 level10 level20)
(sum level10 level14 level24)
(sum level10 level16 level26)
(sum level10 level18 level28)
(sum level10 level21 level31)
(sum level10 level23 level33)
(sum level11 level5 level16)
(sum level11 level7 level18)
(sum level11 level10 level21)
(sum level11 level14 level25)
(sum level11 level16 level27)
(sum level11 level18 level29)
(sum level11 level21 level32)
(sum level11 level23 level34)
(sum level12 level5 level17)
(sum level12 level7 level19)
(sum level12 level10 level22)
(sum level12 level14 level26)
(sum level12 level16 level28)
(sum level12 level18 level30)
(sum level12 level21 level33)
(sum level12 level23 level35)
(sum level13 level5 level18)
(sum level13 level7 level20)
(sum level13 level10 level23)
(sum level13 level14 level27)
(sum level13 level16 level29)
(sum level13 level18 level31)
(sum level13 level21 level34)
(sum level13 level23 level36)
(sum level14 level5 level19)
(sum level14 level7 level21)
(sum level14 level10 level24)
(sum level14 level14 level28)
(sum level14 level16 level30)
(sum level14 level18 level32)
(sum level14 level21 level35)
(sum level14 level23 level37)
(sum level15 level5 level20)
(sum level15 level7 level22)
(sum level15 level10 level25)
(sum level15 level14 level29)
(sum level15 level16 level31)
(sum level15 level18 level33)
(sum level15 level21 level36)
(sum level15 level23 level38)
(sum level16 level5 level21)
(sum level16 level7 level23)
(sum level16 level10 level26)
(sum level16 level14 level30)
(sum level16 level16 level32)
(sum level16 level18 level34)
(sum level16 level21 level37)
(sum level16 level23 level39)
(sum level17 level5 level22)
(sum level17 level7 level24)
(sum level17 level10 level27)
(sum level17 level14 level31)
(sum level17 level16 level33)
(sum level17 level18 level35)
(sum level17 level21 level38)
(sum level17 level23 level40)
(sum level18 level5 level23)
(sum level18 level7 level25)
(sum level18 level10 level28)
(sum level18 level14 level32)
(sum level18 level16 level34)
(sum level18 level18 level36)
(sum level18 level21 level39)
(sum level18 level23 level41)
(sum level19 level5 level24)
(sum level19 level7 level26)
(sum level19 level10 level29)
(sum level19 level14 level33)
(sum level19 level16 level35)
(sum level19 level18 level37)
(sum level19 level21 level40)
(sum level19 level23 level42)
(sum level20 level5 level25)
(sum level20 level7 level27)
(sum level20 level10 level30)
(sum level20 level14 level34)
(sum level20 level16 level36)
(sum level20 level18 level38)
(sum level20 level21 level41)
(sum level21 level5 level26)
(sum level21 level7 level28)
(sum level21 level10 level31)
(sum level21 level14 level35)
(sum level21 level16 level37)
(sum level21 level18 level39)
(sum level21 level21 level42)
(sum level22 level5 level27)
(sum level22 level7 level29)
(sum level22 level10 level32)
(sum level22 level14 level36)
(sum level22 level16 level38)
(sum level22 level18 level40)
(sum level23 level5 level28)
(sum level23 level7 level30)
(sum level23 level10 level33)
(sum level23 level14 level37)
(sum level23 level16 level39)
(sum level23 level18 level41)
(sum level24 level5 level29)
(sum level24 level7 level31)
(sum level24 level10 level34)
(sum level24 level14 level38)
(sum level24 level16 level40)
(sum level24 level18 level42)
(sum level25 level5 level30)
(sum level25 level7 level32)
(sum level25 level10 level35)
(sum level25 level14 level39)
(sum level25 level16 level41)
(sum level26 level5 level31)
(sum level26 level7 level33)
(sum level26 level10 level36)
(sum level26 level14 level40)
(sum level26 level16 level42)
(sum level27 level5 level32)
(sum level27 level7 level34)
(sum level27 level10 level37)
(sum level27 level14 level41)
(sum level28 level5 level33)
(sum level28 level7 level35)
(sum level28 level10 level38)
(sum level28 level14 level42)
(sum level29 level5 level34)
(sum level29 level7 level36)
(sum level29 level10 level39)
(sum level30 level5 level35)
(sum level30 level7 level37)
(sum level30 level10 level40)
(sum level31 level5 level36)
(sum level31 level7 level38)
(sum level31 level10 level41)
(sum level32 level5 level37)
(sum level32 level7 level39)
(sum level32 level10 level42)
(sum level33 level5 level38)
(sum level33 level7 level40)
(sum level34 level5 level39)
(sum level34 level7 level41)
(sum level35 level5 level40)
(sum level35 level7 level42)
(sum level36 level5 level41)
(sum level37 level5 level42)

(connected l0 l2)
(fuelcost level16 l0 l2)
(connected l0 l3)
(fuelcost level18 l0 l3)
(connected l0 l4)
(fuelcost level5 l0 l4)
(connected l1 l2)
(fuelcost level10 l1 l2)
(connected l1 l3)
(fuelcost level14 l1 l3)
(connected l1 l5)
(fuelcost level21 l1 l5)
(connected l2 l0)
(fuelcost level16 l2 l0)
(connected l2 l1)
(fuelcost level10 l2 l1)
(connected l2 l4)
(fuelcost level7 l2 l4)
(connected l2 l5)
(fuelcost level5 l2 l5)
(connected l3 l0)
(fuelcost level18 l3 l0)
(connected l3 l1)
(fuelcost level14 l3 l1)
(connected l3 l5)
(fuelcost level23 l3 l5)
(connected l4 l0)
(fuelcost level5 l4 l0)
(connected l4 l2)
(fuelcost level7 l4 l2)
(connected l5 l1)
(fuelcost level21 l5 l1)
(connected l5 l2)
(fuelcost level5 l5 l2)
(connected l5 l3)
(fuelcost level23 l5 l3)

(at t0 l0)
(fuel t0 level42)
(= (total-cost) 0)

(at p0 l1)
(at p1 l2)
(at p2 l0)
(at p3 l1)
)

(:goal
(and
(at p0 l4)
(at p1 l1)
(at p2 l1)
(at p3 l2)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p2 t0 l0)
   deleted: (at p2 l0)
   added: (in p2 t0)
   goals met: 0 of 4
2. (drive t0 l0 l4 level37 level5 level42)
   deleted: (at t0 l0) (fuel t0 level42)
   added: (at t0 l4) (fuel t0 level37)
   goals met: 0 of 4
3. (drive t0 l4 l2 level30 level7 level37)
   deleted: (at t0 l4) (fuel t0 level37)
   added: (at t0 l2) (fuel t0 level30)
   goals met: 0 of 4
4. (load p1 t0 l2)
   deleted: (at p1 l2)
   added: (in p1 t0)
   goals met: 0 of 4
5. (drive t0 l2 l1 level20 level10 level30)
   deleted: (at t0 l2) (fuel t0 level30)
   added: (at t0 l1) (fuel t0 level20)
   goals met: 0 of 4
6. (unload p2 t0 l1)
   deleted: (in p2 t0)
   added: (at p2 l1)
   goals met: 1 of 4
7. (unload p1 t0 l1)
   deleted: (in p1 t0)
   added: (at p1 l1)
   goals met: 2 of 4
8. (load p3 t0 l1)
   deleted: (at p3 l1)
   added: (in p3 t0)
   goals met: 2 of 4
9. (load p0 t0 l1)
   deleted: (at p0 l1)
   added: (in p0 t0)
   goals met: 2 of 4
10. (drive t0 l1 l2 level10 level10 level20)
   deleted: (at t0 l1) (fuel t0 level20)
   added: (at t0 l2) (fuel t0 level10)
   goals met: 2 of 4
11. (unload p3 t0 l2)
   deleted: (in p3 t0)
   added: (at p3 l2)
   goals met: 3 of 4
12. (drive t0 l2 l4 level3 level7 level10)
   deleted: (at t0 l2) (fuel t0 level10)
   added: (at t0 l4) (fuel t0 level3)
   goals met: 3 of 4
13. (unload p0 t0 l4)
   deleted: (in p0 t0)
   added: (at p0 l4)
   goals met: 4 of 4
